Tekla.Structures.ModelInternal.IntList
The IntList class defines a type safe list of integers.
The following example adds some integers to the list and calculates the sum of them:
using Tekla.Structures.ModelInternal;
public class Example
{
public void Example1()
{
int Sum = 0;
IntList MyIntList = new IntList();
MyIntList.Add(1);
MyIntList.Add(2);
MyIntList.Add(5);
foreach(int MyInt in MyIntList)
{
Sum += MyInt;
}
}
}

Tekla.Structures.ModelInternal.IntList.Item(System.Int32)
Gets or sets the integer at the specified index.
Index: The zero-based index of the element to get or set.

Tekla.Structures.ModelInternal.IntList.#ctor
Create an empty IntList.

Tekla.Structures.ModelInternal.IntList.#ctor(System.Collections.IEnumerable)
Create an IntList with content.
integers: An IEnumberable of integers. All the objects must be int's.

Tekla.Structures.ModelInternal.IntList.Add(System.Int32)
Adds a new integer to the end of the string list.
Value: The integer to be added to the list.
Returns: The index where the integer was added.

Tekla.Structures.ModelInternal.IntList.Contains(System.Int32)
Checks if the given integer is in the list.
Value: The integer to be checked.
Returns: True if the integer is in the list, otherwise false.

Tekla.Structures.ModelInternal.IntList.IndexOf(System.Int32)
Gets the index of the specified integer.
Value: The integer to locate in the list.
Returns: The index of the integer if found in the list, otherwise -1.

Tekla.Structures.ModelInternal.IntList.IndexOf(System.Int32,System.Int32)
Gets the index of the specified integer between the index to start
the search from and the end of the list.
Value: The integer to locate in the list.
StartIndex: The index to start the search from.
Returns: The index of the integer if found in the list, otherwise -1.

Tekla.Structures.ModelInternal.IntList.IndexOf(System.Int32,System.Int32,System.Int32)
Gets the index of the specified integer between the index to start the search from and StartIndex + Count.
Value: The integer to locate in the list.
StartIndex: The index to start the search from.
Count: The number of items searched.
Returns: The index of the integer if found in the list, otherwise -1.

Tekla.Structures.ModelInternal.IntList.Insert(System.Int32,System.Int32)
Inserts the integer to the specified index.
Index: The index where the integer is inserted.
Value: The integer to be inserted.

Tekla.Structures.ModelInternal.IntList.GetRange(System.Int32,System.Int32)
Gets a sub-list of the integer list.
Index: The start index of the new list.
Count: The number of items in the new list.
Returns: The new integer list.

Tekla.Structures.ModelInternal.IntList.LastIndexOf(System.Int32)
Searches for the last occurence of the integer in the list.
Value: The integer to locate.
Returns: The last index of the integer if found, otherwise -1.

Tekla.Structures.ModelInternal.IntList.LastIndexOf(System.Int32,System.Int32)
Searches for the last occurence of the integer in the list.
Value: The integer to locate.
StartIndex: The index to start the search from.
Returns: The last index of the integer if found, otherwise -1.

Tekla.Structures.ModelInternal.IntList.LastIndexOf(System.Int32,System.Int32,System.Int32)
Searches for the last occurence of the integer in the list.
Value: The integer to locate.
StartIndex: The index to start the search from.
Count: The number of items searched.
Returns: The last index of the integer if found, otherwise -1.

Tekla.Structures.ModelInternal.IntList.Remove(System.Int32)
Removes the first occurence of the integer from the list.
Value: The integer to be removed.

Tekla.Structures.ModelInternal.IntList.RemoveRange(System.Int32,System.Int32)
Removes a range of items starting from the given index.
Index: The start index.
Count: The number of items to be removed.

Tekla.Structures.ModelInternal.IntList.ToArray
Copies the integers to an integer array.
Returns: The array of integers.

Tekla.Structures.ModelInternal.IntList.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.